Revit 2024 API
ContinuousRailType.EndOrTopExtensionLength Property
 The extension length of the rail termination at the end or top.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double EndOrTopExtensionLength { get; set; }
Visual Basic
Public Property EndOrTopExtensionLength As Double
	Get
	Set
Visual C++
public:
property double EndOrTopExtensionLength {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for endExtensionLength must be between 0 and 30000 feet.
See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace